constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (25 0 0)
    (25 17 0)
    (0 17 0)
    (0 0 25)
    (25 0 25)
    (25 17 25)
    (0 17 25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 25 30) simpleGrading (1 2 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    sides
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    film
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
