constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    top
    {
        type            wall;
        nFaces          2828;
        startFace       415372;
    }
    dominio_ascii
    {
        type            wall;
        nFaces          8400;
        startFace       418200;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        nFaces          2828;
        startFace       426600;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
2828
(
(-5.421010862e-20 -0 -0)
(2.710505431e-20 -0 -0)
(-0 -0 -1.734723476e-18)
(-2.710505431e-20 -0 -1.734723476e-18)
(-0 -0 3.469446952e-18)
(-0 -0 -0)
(-2.168404345e-19 -0 -3.469446952e-18)
(1.084202172e-19 -0 1.734723476e-18)
...
)
;
    }
)

// ************************************************************************* //
