constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         no;
    transient       yes;
    cellValueSourceCorrection no;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            hs              explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
        T               cell;
        Cp              cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    TMin            200;
    pMin            1000;
    minParticleMass 1e-15;

    rho0            1000;
    T0              300;
    Cp0             4187;

    youngsModulus   1e9;
    poissonsRatio   0.35;

    epsilon0        1;
    f0              0.5;
    Pr              0.7;
    Tvap            273;
    Tbp             373;

    constantVolume  false;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModel  coneInjection;

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel none;

    compositionModel singlePhaseMixture;

    phaseChangeModel none;

    surfaceFilmModel thermoSurfaceFilm;

    radiation       off;

    coneInjectionCoeffs
    {
        SOI             0.000;
        duration        20.000;
        positionAxis
        (
            ((0.0125 0.017 0.0125) (0 -1 0))
            ((0.0125 0.016 0.0125) (0 -1 0))
        );

        massTotal       0.02778;
        parcelsPerInjector 200000;
        parcelsPerSecond 10000;
        parcelBasisType mass;
        flowRateProfile constant 1;
        Umag            constant 12.2716;
        thetaInner      constant 0;
        thetaOuter      constant 39;

        sizeDistribution
        {
            type         RosinRammler;
            
            RosinRammlerDistribution
            {
                minValue        5e-04; // the minimum droplet diameter, m
                maxValue        0.0012; // the maximum droplet diameter, m
                d               7.5e-05; // diameter with the largest probability, m
                n               0.5; // the exponential factor
            }
        }
    }

    standardWallInteractionCoeffs
    {
        type            escape;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                H2O          1;
            }
        );
    }

    thermoSurfaceFilmCoeffs
    {
        interactionType splashBai;
        deltaWet        0.0005;
        Adry            2630;
        Awet            1320;
        Cf              0.6;
    }
}


cloudFunctions
{}


// ************************************************************************* //
